Repository: ph0ngp/linglook
Catalog: xcode13/Shared (App)/Localizable.xcstrings
Source language: en
Languages: vi, zh_hans, zh_hant

# device_note
source: Please note: the instructions shown here are based on the iPhone interface. Button positions may vary slightly on this device.
vi: Chú ý: các hướng dẫn được minh hoạ ở đây dựa trên giao diện iPhone. Trên thiết bị này, vị trí các nút có thể hơi khác một chút.
zh_hans: 请注意：此处显示的说明基于 iPhone 界面。在此设备上，按钮位置可能略有不同。
zh_hant: 請注意：此處顯示的說明基於 iPhone 介面。在此設備上，按鈕位置可能略有不同。

# extension_is_disabled
source: LingLook is disabled. Please enable LingLook in Safari Extension Preferences.
vi: LingLook chưa được kích hoạt. Vui lòng bật LingLook trong tuỳ chọn Phần mở rộng của Safari.
zh_hans: LingLook 已关闭。请在 Safari 扩展偏好设置中启用 LingLook。
zh_hant: LingLook 已關閉。請在 Safari 延伸功能偏好設定中啟用 LingLook。

# extension_is_enabled
source: LingLook is enabled
vi: LingLook đã được kích hoạt
zh_hans: LingLook 已启用
zh_hant: LingLook 已啟用

# lang_code
source: en
vi: vi
zh_hans: zh
zh_hant: tw

source: Open Safari Extension Preferences
vi: Mở tuỳ chọn Phần mở rộng của Safari
zh_hans: 打开 Safari 扩展偏好设置
zh_hant: 打開 Safari 延伸功能偏好設定

# step1
source: First, enable the extension by opening Safari and navigating to any website. Click the button on the left side of the address bar to open the menu.
vi: Trước tiên, bạn cần kích hoạt tiện ích mở rộng này bằng cách mở Safari và truy cập vào một trang web bất kỳ. Nhấn vào nút ở bên trái thanh địa chỉ để mở menu.
zh_hans: 首先，您需要启用扩展。打开 Safari 浏览器并访问任意网站。然后，点击地址栏左侧的按钮以打开菜单。
zh_hant: 首先，您需要啟用延伸功能。打開 Safari 並訪問任意網站。然後，點擊地址欄左側的按鈕以打開選單。

# step2
source: Select "Manage Extensions", enable LingLook, then click "Done"
vi: Chọn "Quản lý phần mở rộng", bật LingLook, sau đó nhấn "Xong"
zh_hans: 选择“管理扩展”，启用 LingLook，然后点击“完成”。
zh_hant: 選擇「管理延伸功能」，啟用 LingLook，然後點擊「完成」。

# step3
source: In the menu, click on "LingLook"
vi: Trong menu, nhấn vào "LingLook"
zh_hans: 在菜单中，点击“LingLook”。
zh_hant: 在選單中，點擊「LingLook」。

# step4
source: On the next screen, click "Always Allow...". Rest assured, LingLook will never access or store any of your data. This permission is only needed to access the text on the page for the lookup function.
vi: Ở màn hình tiếp theo, nhấn "Luôn Cho phép...". Xin yên tâm, LingLook sẽ không bao giờ truy cập hoặc lưu trữ bất kỳ dữ liệu nào của bạn. Quyền này chỉ được sử dụng để đọc chữ tiếng Trung trên trang web nhằm mục đích tra từ.
zh_hans: 在下一个屏幕中，点击“始终允许...”。请放心，LingLook 绝不会访问或存储您的任何数据。此权限仅用于访问页面上的文本以执行查找功能。
zh_hant: 在下一個畫面中，點擊「永遠允許...」。請放心，LingLook 絕不會訪問或存儲您的任何數據。此權限僅用於訪問頁面上的文本以執行查找功能。

# step5
source: On the following screen, click "Always Allow on Every Website"
vi: Ở màn hình tiếp theo, nhấn "Luôn luôn cho phép trên mọi trang web"
zh_hans: 在下一个屏幕中，点击“在每个网站上始终允许”。
zh_hant: 在下一個畫面中，點擊「一律在每個網站允許」。

# step6
source: Congratulations! LingLook is now enabled successfully. You can move the puck around to look up Chinese text. You can enable or disable the puck anytime by clicking on LingLook in the menu.
vi: Chúc mừng! LingLook đã được kích hoạt thành công. Bạn có thể di chuyển con trỏ để tra cứu văn bản tiếng Trung. Bạn có thể bật hoặc tắt con trỏ này bất cứ lúc nào bằng cách nhấn vào LingLook trong menu.
zh_hans: 恭喜！LingLook 已成功启用。您可以移动圆盘工具来查找中文文本。您可以随时通过点击菜单中的 LingLook 按钮来启用或禁用该工具。
zh_hant: 恭喜！LingLook 已成功啟用。您可以移動圓盤工具來查找中文文本。您可以隨時通過點擊選單中的 LingLook 按鈕來啟用或禁用該工具。

# step7
source: Switch to the "Character" tab, here you can play stroke order animation and see other character information like its frequency rank, radical, origin, etc.
vi: Chuyển sang tab "Hán tự", ở đây bạn có thể xem minh hoạ thứ tự nét viết và các thông tin khác như thứ hạng phổ biến, bộ thủ, nguồn gốc,...
zh_hans: 切换到“汉字”标签，在这里你可以播放笔顺动画，并查看其他汉字信息，比如频率排名、部首、字源等。
zh_hant: 切換到「漢字」標籤，在這裡你可以播放筆順動畫，並查看其他漢字資訊，比如頻率排名、部首、字源等。

# step8
source: Single-tap the puck to temporarily disable or enable the lookup function. Double-tap the puck to switch the lookup direction between up and down.
vi: Nhấn một lần vào con trỏ để tạm thời tắt hoặc bật chức năng tra cứu. Nhấn đúp để đổi hướng tra từ thành hướng lên hoặc hướng xuống.
zh_hans: 轻触圆盘工具一次，可暂时禁用或启用查找功能。双击圆盘工具可切换查找方向（向上或向下）。
zh_hant: 輕觸圓盤工具一次，可暫時禁用或啟用查找功能。雙擊圓盤工具可切換查找方向（向上或向下）。
